// 미로탐색(DFS)
// 7*7 격자판 미로를 탈출하는 경로의 가지수를 출력하는 프로그램을 작성하세요. 출발점은 격 자의 (1, 1) 좌표이고, 탈출 도착점은 (7, 7)좌표이다. 격자판의 1은 벽이고, 0은 통로이다. 격 자판의 움직임은 상하좌우로만 움직인다. 미로가 다음과 같다면
// 출발

// 도착
// 위의 지도에서 출발점에서 도착점까지 갈 수 있는 방법의 수는 8가지이다.
// ▣ 입력설명
// 7*7 격자판의 정보가 주어집니다.
// ▣ 출력설명
// 첫 번째 줄에 경로의 가지수를 출력한다.
// ▣ 입력예제 1
// 0000000 0111110 0001000 1101011 1100001 1101100 1000000
// ▣ 출력예제 1 8

function solution(board) {
  //0,0 6,6
  let start = [0, 0];
  let end = [6, 6];
  let routes = [];
  let direction = new Map([1, "UP"], [2, "RIGHT"], [3, "DOWN"], [4, "LEFT"]);
  function dfs(enter, door, left, route) {
    //온 방향을 제외한 나머지 모든 방향이 1이면 return
    // 인덱스가 6,6면 리턴
    // 아닐 시 계속 진행
    let answer = 0;
    let dx = [-1, 0, 1, 0];
    let dy = [0, 1, 0, -1];
    function DFS(x, y) {
      if (x === 6 && y === 6) answer++;
      else {
        for (let k = 0; k < 4; k++) {
          let nx = x + dx[k];
          let ny = y + dy[k];
          if (nx >= 0 && nx <= 6 && ny >= 0 && ny <= 6 && board[nx][ny] === 0) {
            board[nx][ny] = 1;
            DFS(nx, ny);
            board[nx][ny] = 0;
          }
        }
      }
    }
    board[0][0] = 1;
    DFS(0, 0);
    return answer;
  }
}

let arr = [
  [0, 0, 0, 0, 0, 0, 0],
  [0, 1, 1, 1, 1, 1, 0],
  [0, 0, 0, 1, 0, 0, 0],
  [1, 1, 0, 1, 0, 1, 1],
  [1, 1, 0, 0, 0, 0, 1],
  [1, 1, 0, 1, 1, 0, 0],
  [1, 0, 0, 0, 0, 0, 0],
];

console.log(solution(arr));
